[{"model": "blog.post", "pk": 1, "fields": {"title": "Keeping Your Cat’s Weight in Check", "slug": "cat-weight-diet-nutrition", "author": 2, "image": "blog_images/slider_3.jpg", "content": "Keeping your cat’s weight in check\r\nJust like us, cats will put on weight if they eat too much and don’t exercise enough. Obesity is one of the most common health problems seen by our vets. It can cause health problems such as:\r\n•\tDiabetes\r\n•\tHeart disease\r\n•\tArthritis.\r\nPets with conditions like these often die younger which is heart-breaking for their owners.\r\n\r\nA healthy body shape for your cat\r\nLooking at your cat’s shape is the best way of keeping an eye on their weight. That’s because the ideal weight varies for every type and breed - but the ideal shape is the same for every cat.\r\nCheck your cat’s weight every couple of weeks, starting when they’re a kitten. You’ll quickly learn what’s normal for your cat. All you have to do is look and feel:\r\n•\tLook at your cat from the side and from above. They should have a smooth, tucked-in waist.\r\n•\tFeel under your cat’s tummy. It should go in, not bulge out.\r\n•\tFeel along your cat’s side and back. You should be able to feel your cat’s ribs, spine and hipbones quite easily but they shouldn’t stick out.\r\n•\tFeel the base of your cat’s tail. There shouldn’t be any build-up of fat where the tail meets your cat’s back.\r\nYour vet or vet nurse can show you how to check your cat’s shape.\r\nAnother top tip is to keep a food diary for a week, and take it with you when you go to see your vet. This can help you spot where your cat is getting the extra calories, and makes it easier to cut them out without a special diet.\r\nDownload our guide to getting your cat into shape for more information on checking your cat’s shape and an example food diary to get your cat on their way to a healthy weight.", "created_on": "2021-02-11T09:17:35.964Z", "status": 1}}, {"model": "blog.post", "pk": 2, "fields": {"title": "How to Litter Train Your Cat", "slug": "how-to-litter-train-cat", "author": 2, "image": "blog_images/slider4.jpg", "content": "Cats are usually very clean animals, however if you have adopted a new cat or kitten you may find that they have trouble using the litter tray at first.\r\nIt’s important to remember to be patient with your cat and never punish them if they go to the toilet outside their litter tray. They won’t understand why you’re telling them off and it may cause more problems as they’ll get stressed and anxious.\r\n \r\nWhy won’t my cat use the litter tray?\r\nThere are lots of reasons your cat might not want to use their litter tray. We would recommend visiting your vet first to rule out any underlying medical issues.\r\n•\tStress. If cats are stressed, they are more likely to have accidents around the house. You can read up on how to prevent your cat from getting stressed on our pet care pages.\r\n•\tIllness. Cats might also urinate outside of the litter tray if they have a urinary tract problem, especially if they are quite vocal when trying to pee. You will need to take your cat to the vet for treatment if they are showing signs of a urinary problem.\r\n•\tAge. Very young kittens who have not been taught by their mother may not understand what the litter tray is for. Similarly, older cats who aren’t used to a litter tray may not want to use one at first, especially if they’re used to going to the toilet outside.\r\n•\tLocation. Where you put your cat’s litter tray is very important. Our vets recommend that you should provide at least two trays for your cat. These should be away from their food and water areas in a quiet part of the house.\r\n•\tLitter. There are lots of different types of litter available and our felines are known for being fussy! Some cats prefer ‘gravel’, others love the clumping sand style litter. There’s a chance they may not be using their litter tray simply because they don’t like the type of litter you’re currently using.\r\n•\tTray. As with litter, our cats can be fussy about their litter tray as well. Some prefer higher sides, some are happy with a standard tray and some cats like the covered ones.\r\n \r\nHow can I get my cat to use the litter tray?\r\nIf your cat just won’t use their litter tray, there are several steps you can take to help them learn to use it. Again, never tell your cat off as you could end up making the situation worse.\r\nStep one – litter tray location\r\nIf you’ve set up your cat’s litter trays in a certain area they aren’t using, pay attention to where they do go. Try putting a litter tray down where they’ve been going to the toilet to encourage them to go in the tray.\r\nKeep a close eye on your cat if they look like they want to go to the toilet. With kittens, place them in or near their tray to encourage them to go to the toilet in there. It may take them a few times to grasp the idea but keep trying.\r\nStep two – the right litter and tray\r\nIf you’ve moved your trays to the place your cat always seems to go to the toilet, but they still aren’t using it, it might not be location that’s the problem. Try experimenting with different types of cat litter – you may find they have a preference. Some types of litter can be uncomfortable on their paws, others may not absorb urine very well which can mean the cat avoids getting their paws wet in there.\r\nIf they seem happy with the litter and dig around but still don’t like to go to the toilet in their tray, try using a different tray. Some cats prefer the hooded trays over the standard open ones. If they are straining to go to the toilet, seem uncomfortable or haven’t been toileting as normal, then it is always best to seek advice from your vet immediately.\r\nStep three – reward good behaviour\r\nOnce you’ve found what tray and litter your cat prefers and where they like their tray, keep an eye on them when they look like they might need the toilet. Give them lots of praise once they have been to the toilet in their tray so they know they’ve done something really good.\r\nIt may take a bit of time but your cat will eventually always go in their trays. Remember to keep an eye on them and take them to the vet if you think they are having problems going to the toilet. If you have a male cat who is straining to pass urine , then this could be a real emergency and he will need to be seen by the vets immediately.\r\n \r\nTop tips for litter training\r\n•\tAlways keep your cat’s trays as clean as possible, as they won’t go in a dirty tray.\r\n•\tNever punish your cat for having an accident. Instead, reward the good behaviour so they see the litter tray as a good thing.\r\n•\tExperiment with different types of litter and trays if they aren’t using their trays at first.\r\n•\tClean up any accidents straight away to stop them from going in the same place again.\r\n•\tKeep your cat as stress-free as possible. A stressed cat is more likely to have accidents.", "created_on": "2021-02-11T09:19:12.070Z", "status": 1}}, {"model": "blog.post", "pk": 3, "fields": {"title": "Going on Holiday?  Boarding  Your Dog?", "slug": "dog-boarding-kennels", "author": 2, "image": "blog_images/hello-magazine.jpg", "content": "If you can’t take your pet on holiday with you, you’ll need to find someone suitable to look after them while you’re away.\r\nNowadays, there’s lots of different options for holiday pet care:\r\n•\tFriends and family\r\n•\tProfessional pet sitters\r\n•\tBoarding kennels, catteries or ‘pet hotels’\r\n•\tHome from home dog boarding\r\n \r\nWhat’s best for your pet\r\nLots of pets find going into kennels or catteries quite stressful. They’d prefer to stay in their own home where they feel safe and secure. Cats especially are often better off if they can stay in a familiar environment. Friends and family or professional pet sitters might be able to look after your pet in your home. You can find a pet sitter through the National Association of Registered Pet Sitters. Call 0845 230 8544 or visit their website to find a local pet sitter.\r\n'Home from home' boarding, which tends to be for dogs and small pets or occasionally cats, would usually have your pet staying in a home rather than in a kennel. They'll have their own room and be treated like part of the family. This is a good solution for pets who need a little extra care or who're nervous of being in a kennel.\r\nIf those options aren’t available, you should book your pet into a reputable local kennel or cattery. In traditional boarding kennels or catteries, pets are kept in a kennel while you're on holiday. They get walked each day and have opportunity for play time. Some kennels or catteries will advertise themselves as 'pet hotels' and may offer more luxurious extras such as an individual room for your pet or comfier bedding or more socialising with the staff. But some 'normal' kennels will also offer these services, so it's best to check what's available in your area.\r\nWhichever option you pick, do plenty of research, visit premises in person before you book your pet in, don’t rely on websites and ask friends or your vet for recommendations. Makes sure to check the business you are using is licensed by the local council too and in England check the ‘star rating’ on the license – we recommend looking for a five star rating (the highest possible).\r\nGood boarding places often get fully-booked during busy holiday times, like summer and Christmas, so book early.\r\n \r\nHow to prepare your pet for boarding\r\nHere are our vets’ top tips to help make sure your pet stays happy and healthy while you’re away:\r\n•\tVaccinations: Reputable boarding kennels and catteries will all want to know that your pet’s vaccinations are up-to-date. Unvaccinated pets won’t be allowed to stay, as there’s a risk they’ll pick up or pass diseases on to other pets. Speak to your vet about when your pet needs their boosters and get any necessary vaccinations well in advance. Make sure your pet’s vaccination record is up-to-date and take it along when you drop your pet off for boarding. Don’t leave vaccinations until the last minute, especially kennel cough! There may be a specific time frame between vaccination and them accepting your pet to board. \r\n\r\n•\tMedication: If your pet has to take regular medication to keep them well, make sure you have enough to cover the time you’re away. Speak to the person who’s looking after your pet and leave written instructions for them to follow. They’ll need to know what medication to give and when (e.g. morning, evening, before food, after food) and the best way to get your pet to take it, if it’s a tablet. Make sure that the person looking after them is confident giving the medication and knows what to do if there are any problems or side effects seen.\r\n\r\n•\tContact details: Make sure the person looking after your pet has your vet’s contact details in case of emergencies. They’ll also need your contact details for while you’re away – extra info like the name, address and telephone number of your hotel can be useful as a back-up as well as your mobile number. Find out their protocol if they can’t get in touch with you and need to take your pet to a vet and make sure this fits with your wishes.\r\n•\tFood and exercise: A sudden change in your pet’s diet can give them an upset stomach. Provide more than enough of your pet’s usual food to cover the time you’ll be away. Leave written instructions about how much food should be given and when, and how much exercise your pet usually gets.\r\n•\tToys and blankets: Blankets which smell of home can help your pet to settle into their temporary home. Their favourite toys will help stop them from getting bored if they’re in a kennel on their own.", "created_on": "2021-02-11T09:21:01.521Z", "status": 1}}, {"model": "blog.post", "pk": 4, "fields": {"title": "Your Puppy Questions ... All The FAQs", "slug": "puppy-nutrition-care-tips", "author": 2, "image": "blog_images/pexels-photo-1108099_xcf0gKL.jpeg", "content": "Getting a new puppy can be really exciting, but if you’re a fist-time owner or have never had a puppy before it can also be daunting! We’re here to help you with some of the most common things you might come across.\r\nWhether you’re thinking of getting a puppy or have just brought your new bundle of joy home – you might have a lot of questions! We’ve been looking at some of the most common questions puppy owners ask and helping answer them.\r\n\r\nWhen can my puppy go outside for a walk or in the garden?\r\nGoing in the garden\r\nAs long as your garden is safe and enclosed with solid fences and not used by other dogs, then your puppy can go out in the garden straight away. It’ll help to build their confidence, get them used to their new home and you can start their toilet training!\r\nGoing on their first walk\r\nTaking your puppy for their first walk is a huge milestone, but you’ll need to wait until they are fully covered by their vaccinations to be safe. This is usually a few weeks after their second jab in their primary vaccination course, but this does vary from vaccine to vaccine. It’s best to ask your vet when you take them in for their jabs as they’ll be able to give you exact timings.\r\nWhen can my puppy meet other dogs?\r\nYou’ll need to wait until your puppy is fully vaccinated before letting them meet other dogs. This will help stop them getting any nasty diseases. Wait for the all clear from your vet, then you can take your puppy out and about to socialise. Keep them on the lead and watch other dogs’ body language to make sure they are happy to greet your puppy. Always ask owners first before you allow your puppy to go up to strange dogs.\r\n \r\nHow should I introduce my new puppy to my current dog?\r\nYou’ll need to make sure your current dog is fully vaccinated and well in themselves before bringing your new puppy home. Then it’s best to do introductions slowly, making sure your dog has a quiet space away from your boisterous new puppy!\r\nObviously it might be a bit difficult to introduce them on ‘neutral territory’ because your puppy won’t be fully protected by their vaccinations yet, but do take away favourite toys or anything that your current dog feels protective over so that these won’t become a problem between your dog and puppy. You should probably keep both dogs on a loose lead when they first meet – make sure you can recognise their body language so you know if the meeting is going well.\r\nAlways supervise your dogs together. Remember your puppy may be a lot more playful than your current dog so make sure you are playing with your puppy to give your other dog some space, but make sure you stick to your current routine with your first dog so that they don’t feel a dramatic change to their life.\r\nRemember to feed both dogs away from each other so neither feels the need to guard their food as this can cause a lot of tension between them long term.\r\nHow do I crate train my puppy?\r\nCrates are a good way of making sure your puppy is secure and out of any mischief at night! Again, it’s something your puppy will need to get slowly used to and each dog will take a different amount of time before they are happy to be in their crate. Read our article on crate training for the full how-to guide.\r\n \r\nWhy is my puppy biting and chewing and how can I stop it?\r\nNibbling and chewing is a natural part of being a puppy. Just like people, puppies go through teething and need to bite and chew. They also explore the world through their mouth, so it’s only natural that they bite and chew anything and everything they can! Rather than trying to stop them from chewing, make sure you give them lots of dog-safe toys they can chew. Find out more about training your dog not to chew.\r\n \r\nWhat should I feed my puppy? How much should I be feeding my puppy?\r\nWe’d recommend a complete, life stage appropriate puppy food (so one that’s labelled as being for puppies rather than an adult or senior food). This is because puppies need different levels of nutrients to help them grow. Look out for specific puppy diets such as puppy food for large breeds, or puppy food for toy/small breeds. If you need to change your puppy to a different food, make sure you do this over a couple of weeks to avoid stomach upsets.\r\nFollow the advice on the packet for how much to feed your puppy. If you’re unsure, ask your vet or vet nurse and they can give you the best advice for your dog. Remember not to feed your puppy any human food or scraps. We know it’s hard to resist those puppy-dog eyes, but some human foods are harmful to our dogs and can unbalance their diet. Don’t forget to read up on your dog’s diet throughout their life stages", "created_on": "2021-02-11T09:23:09.158Z", "status": 1}}, {"model": "blog.post", "pk": 5, "fields": {"title": "Kittens and Lockdown", "slug": "kitten-care-lockdown", "author": 2, "image": "blog_images/pdsa3.jpg", "content": "Socialisation is all about introducing kittens to the world in a positive way so they don’t get scared of everyday noises, sounds, experiences and people. A well-socialised kitten who has had lots of good experiences will grow into a confident, happy cat.\r\nWe call this period of a cat’s life the ‘socialisation period’, where they’re given chance to explore and understand everything around them. Well socialised kittens are less fearful as adults and more likely to form positive relationships", "created_on": "2021-02-22T09:39:16.493Z", "status": 1}}, {"model": "blog.post", "pk": 6, "fields": {"title": "How To Train Your Puppy --- The RIGHT Way!", "slug": "training-new-puppy-tips", "author": 2, "image": "blog_images/pdsa4.jpg", "content": "All the facts on how to train without the pain !", "created_on": "2021-02-22T12:17:58.497Z", "status": 1}}, {"model": "blog.post", "pk": 7, "fields": {"title": "Exercising Your Dog Correctly - How to Avoid Injuries", "slug": "dog-exercise-tips-facts", "author": 2, "image": "blog_images/jumping-dog.jpg", "content": "Always pay attention to your dog and exercise him nicely and not too much", "created_on": "2021-02-22T12:24:49.628Z", "status": 1}}]